In [1]:
#import pandas library
import pandas as pd

In [2]:
#creating dataframe by reading csv file
df = pd.read_csv("titanic.csv")

In [3]:
#check first 5 rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
#drop unnecessary columns
input_df = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked','Survived'],axis='columns')

In [5]:
target_value = df['Survived']
#target_value print kore deklham

In [6]:
input_df.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [7]:
target_value

0     0
1     1
2     1
3     1
4     0
     ..
95    0
96    0
97    1
98    1
99    0
Name: Survived, Length: 100, dtype: int64

In [8]:
from sklearn.preprocessing import LabelEncoder

In [9]:
#encoding..... convert text to number
le_pclass = LabelEncoder() #Le= LabelEncoder
le_sex = LabelEncoder()
le_age = LabelEncoder()
le_fare = LabelEncoder()

In [12]:
#adding new column Pclass_new,Sex_new,Age_new,Fare_new
input_df['pclass_new'] = le_pclass.fit_transform(input_df['Pclass'])
input_df['sex_new'] = le_sex.fit_transform(input_df['Sex'])
input_df['age_new'] = le_age.fit_transform(input_df['Age'])
input_df['fare_new']= le_fare.fit_transform(input_df['Fare'])

In [13]:
#check added column
input_df

    Pclass     Sex   Age     Fare  pclass_new  sex_new  age_new  fare_new
0        3    male  22.0   7.2500           2        1       16         2
1        1  female  38.0  71.2833           0        0       31        61
2        3  female  26.0   7.9250           2        0       20        10
3        1  female  35.0  53.1000           0        0       30        56
4        3    male  35.0   8.0500           2        1       30        12
..     ...     ...   ...      ...         ...      ...      ...       ...
95       3    male   NaN   8.0500           2        1       45        12
96       1    male  71.0  34.6542           0        1       44        48
97       1    male  23.0  63.3583           0        1       17        60
98       2  female  34.0  23.0000           1        0       29        36
99       2    male  34.0  26.0000           1        1       29        37

[100 rows x 8 columns]

In [14]:
input_new = input_df.drop(['Pclass','Sex','Age','Fare'],axis='columns')

In [15]:
#After encoding.....
input_new

    pclass_new  sex_new  age_new  fare_new
0            2        1       16         2
1            0        0       31        61
2            2        0       20        10
3            0        0       30        56
4            2        1       30        12
..         ...      ...      ...       ...
95           2        1       45        12
96           0        1       44        48
97           0        1       17        60
98           1        0       29        36
99           1        1       29        37

[100 rows x 4 columns]

In [16]:
###import tree
from sklearn import tree

In [17]:
#i have used here DecisionTree algorithm for classification
model = tree.DecisionTreeClassifier()

In [19]:
#now fit the model
model.fit(input_new,target_value)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [20]:
#check accuracy
model.score(input_new,target_value)

1.0

In [22]:
model.predict([[2,1,16,2]])

array([0], dtype=int64)